// Завдання: 1
/**
 * Функція `customSet` створює множину з масиву чисел та рядків, але видаляє всі елементи, які є числами.
 * arr - Масив, з якого створюється множина.
 * Повертаємо - Нову множину, яка містить лише рядкові елементи.
 */
function customSet(arr) {
  // Створення множини з масиву за допомогою конструктора Set
  let set = new Set(arr);

  // Перебираємо множину за допомогою 'for of'.
  for (let element of set) {
    // Перевіряємо, чи є елемент числом за допомогою оператора typeof
    if (typeof element === "number") {
      // Якщо елемент є числом, то видаляємо його з множини за допомогою метода delete
      set.delete(element);
    }
  }

  // Повертаємо нову множину, яка вже не містить числових значень
  return set;
}
// Приклад використання функції customSet
console.log("Завдання: 1 ==============================");
console.log(customSet([1, "a", 2, "b", 3, "c"]));
// Виведе: Set(3) { 'a', 'b', 'c' }

// Завдання: 2
/**
 * Функція `clearSet` очищає множину.
 * set - Множина, яку потрібно очистити.
 */
function clearSet(set) {
  // Використання властивості size для перевірки розміру множини, чи більше вона нуля
  if (set.size > 0) {
    // Якщо множина не порожня, використовуємо метод clear для її очищення
    set.clear();
    return "Множину очищено";
  } else {
    // Якщо множина вже порожня, повертаємо відповідне повідомлення
    return "Множина вже порожня";
  }
}

// Приклад використання функції clearSet
console.log("Завдання: 2 ==============================");

console.log(clearSet(new Set([1, 2, 3])));
// Виведе:
// Множину очищено.

// Завдання: 3
/**
 * Функція `addElements` додає елементи до множини з масиву, якщо вони ще не присутні у множині.
 * mySet - Множина, до якої будуть додані елементи.
 * arr - Масив з елементами, які потрібно додати до множини.
 * Повертаємо - Оновлену множину з новими елементами.
 */
function addElements(mySet, arr) {
  // Перебираємо масив та додаємо кожний елемент до множини за допомогою методу add
  arr.forEach((element) => {
    // Метод add додає елемент до множини лише якщо він ще не присутній у множині
    mySet.add(element);
  });

  // Повертаємо оновлену множину
  return mySet;
}

// Приклад використання функції addElements
console.log("Завдання: 3 ==============================");
console.log(addElements(new Set(["a", "b", "c"]), ["d", "e", "f"]));
// Виведе: Set(6) { 'a', 'b', 'c', 'd', 'e', 'f' }

// Завдання: 4
/**
 * Функція `filterAndAdd` видаляє з множини всі числові елементи та додає до множини унікальні значення з масиву,
 * якщо вони ще не присутні в множині. В результаті отримуємо множину, що містить лише рядкові значення.
 *
 * mySet - Множина, з якої будуть видалені числові елементи.
 * arr - Масив, з якого будуть додані унікальні елементи в множину.
 *
 * Повертаємо - Оновлену множину.
 */
function filterAndAdd(mySet, arr) {
  // Перебираємо множину за допомогою 'for of'
  for (let element of mySet) {
    // Перевіряємо, чи є поточний елемент числом
    if (typeof element === "number") {
      // Якщо елемент є числом, видаляємо його з множини за допомогою методу delete
      mySet.delete(element);
    }
  }

  // Перебираємо масив та додаємо кожний елемент до множини за допомогою методу add
  arr.forEach((element) => {
    // Метод add додає елемент до множини лише якщо він ще не присутній у множині
    mySet.add(element);
  });

  // Повертаємо оновлену множину
  return mySet;
}

// Приклад використання функції filterAndAdd
console.log("Завдання: 4 ==============================");
console.log(filterAndAdd(new Set([1, 2, 3, "a", "b", "c"]), ["d", "e", "f"]));
// Виведе: Set(6) { 'a', 'b', 'c', 'd', 'e', 'f' }

// Завдання: 5

/**
 * Функція `checkValueAndType` перевіряє, чи містить множина певне значення та виводить його тип.
 *
 * mySet - Множина, в якій буде проводитися пошук.
 * value - Значення, яке потрібно знайти.
 *
 * Повертаємо - рядок із повідомленням про наявність значення та його тип.
 */
function checkValueAndType(mySet, value) {
  // Використовуємо метод has для перевірки, чи містить множина певне значення
  if (mySet.has(value)) {
    // Якщо значення знайдено, повертаємо рядок з повідомленням про наявність значення та його тип
    return `Множина має значення "${value}" типу "${typeof value}".`;
  } else {
    // Якщо значення не знайдено, повертаємо рядок з повідомленням про відсутність значення
    return `Множина не має значення "${value}".`;
  }
}
// Приклад використання функції checkValueAndType
console.log("Завдання: 5 ==============================");
console.log(checkValueAndType(new Set([1, 2, 3, "a", "b", "c"]), "b"));
// Виведе: Множина має значення "b" типу "string"

// Завдання: 6

/**
 * Функція `setToArray` конвертує множину в масив, видаляє з масиву всі числові елементи
 * та відсортовує рядкові елементи в алфавітному порядку.
 *
 * mySet - Множина, яку треба конвертувати в масив та обробити.
 *
 * Повертаємо - Відсортований масив із рядковими елементами.
 */
function setToArray(mySet) {
  // Конвертуємо множину в масив за допомогою деструктурізації
  let arrayFromSet = [...mySet];

  // Використовуємо метод filter для створення нового масиву, що містить лише рядкові елементи
  let stringElements = arrayFromSet.filter(
    (element) => typeof element === "string"
  );

  // Використовуємо метод sort для сортування рядкових елементів в алфавітному порядку
  stringElements.sort();

  // Повертаємо оброблений масив
  return stringElements;
}

// Приклад використання функції setToArray
console.log("Завдання: 6 ==============================");
console.log(setToArray(new Set([1, 2, 3, "b", "a", "c"])));
// Виведе: ['a', 'b', 'c']

// Завдання: 7

/**
 * Функція `removeDuplicatesInPlace` видаляє дублікати з масиву без створення нового масиву.
 * arr - Масив, з якого потрібно видалити дублікати.
 */
function removeDuplicatesInPlace(arr) {
  let uniqueElements = new Set(); // Створення множини для збереження унікальних елементів

  for (let i = 0; i < arr.length; i++) {
    if (uniqueElements.has(arr[i])) {
      arr.splice(i, 1); // Видалення дублікату
      i--; // Зменшення лічильника
    } else {
      uniqueElements.add(arr[i]); // Додавання унікального елементу до множини
    }
  }
  return uniqueElements; // Повертаємо множину унікальних елементів
}

// Приклад використання функції removeDuplicatesInPlace
console.log("Завдання: 7 ==============================");

console.log(removeDuplicatesInPlace([1, 2, 2, 3, 3, 4, 5, 5]));
// Виведе: Set(5) { 1, 2, 3, 4, 5 }

// Завдання: 8

/**
 * Функція `areDisjoint` перевіряє, чи є дві множини неспільними (не мають спільних елементів).
 * set1 - Перша множина.
 * set2 - Друга множина.
 * Повертаємо - true, якщо множини не мають спільних елементів, інакше false.
 */
function areDisjoint(set1, set2) {
  for (let element of set1) {
    // Перебираємо першу множину за допомогою оператору for of
    if (set2.has(element)) {
      // Якщо знайдено спільний елемент з другою множиною, використовуємо метод has
      return false; // Повертаємо false, якщо є спільний елемент
    }
  }
  return true; // Повертаємо true, якщо немає спільних елементів
}

// Приклад використання функції areDisjoint
console.log("Завдання: 8 ==============================");
console.log(areDisjoint(new Set([1, 2, 3]), new Set([3, 4, 5])));
// Виведе: false

// Завдання: 9

/**
 * Функція `getDifference` повертає множину, яка містить елементи, що належать першій множині, але не належать другій множині.
 * set1 - Перша множина.
 * set2 - Друга множина.
 * Повертаємо - Множина з елементами, що належать set1, але не належать set2.
 */
function getDifference(set1, set2) {
  let differenceSet = new Set(); // Створення множини differenceSet

  for (let element of set1) {
    // Перебір елементів першої множини за допомогою оператору for of
    if (!set2.has(element)) {
      // Якщо елемент не належить другій множині, використовуємо метод has
      differenceSet.add(element); // Додаємо елемент до differenceSet
    }
  }

  return differenceSet; // Повертаємо множину differenceSet з різницею елементів
}

// Приклад використання функції getDifference
console.log("Завдання: 9 ==============================");
console.log(getDifference(new Set([1, 2, 3, 4]), new Set([2, 3])));
// Виведе: Set(2) { 1, 4 }

// Завдання: 10

/**
 * Функція `getIntersection` повертає множину, яка містить спільні елементи двох масивів.
 * arr1 - Перший масив.
 * arr2 - Другий масив.
 * Повертаємо - Множина зі спільними елементами.
 */
function getIntersection(arr1, arr2) {
  let set1 = new Set(arr1); // Створення множини з першого масиву
  let set2 = new Set(arr2); // Створення множини з другого масиву
  let intersectionSet = new Set(); // Створення множини intersectionSet

  for (let element of set1) {
    // Перебір елементів першої множини за допомогою оператору for of
    if (set2.has(element)) {
      // Перевірка, чи елемент є спільним у другій множині
      intersectionSet.add(element); // Додавання спільного елементу до множини intersectionSet
    }
  }

  return intersectionSet; // Повертаємо множину intersectionSet зі спільними елементами
}

// Приклад використання функції getIntersection
console.log("Завдання: 10 ==============================");
console.log(getIntersection([1, 2, 3, 4], [3, 4, 5, 6]));
// Виведе: Set(2) { 3, 4 }

// Завдання: 11

/**
 * Функція `iterateSet` виконує ітерацію по множині та виводить ключі, значення та записи кожного елемента.
 * set - Множина, яку потрібно пройтись.
 */
function iterateSet(set) {
  // Використовуємо метод keys для отримання ітератора ключів
  for (let key of set.keys()) {
    // Виведення ключа у консоль
    console.log("Key:", key);
  }

  // Використовуємо метод values для отримання ітератора значень
  for (let value of set.values()) {
    // Виведення значення у консоль
    console.log("Value:", value);
  }

  // Використовуємо метод entries для отримання ітератора записів
  for (let entry of set.entries()) {
    // Виведення запису у консоль
    console.log("Entry:", entry);
  }
}

// Приклад використання функції iterateSet
console.log("Завдання: 11 ==============================");
iterateSet(new Set(["a", "b", "c"]));
// Виведе:
// a
// b
// c
// a
// b
// c
// [ 'a', 'a' ]
// [ 'b', 'b' ]
// [ 'c', 'c' ]

// Завдання: 12

/**
 * Функція `sumNumbers` рахує суму всіх числових елементів у множині.
 * set - Множина, у якій потрібно порахувати суму чисел.
 * Повертаємо - Суму числових елементів у множині.
 */
function sumNumbers(set) {
  let sum = 0; // Ініціалізація змінної для зберігання суми чисел

  // Використання методу forEach для перебору елементів множини
  set.forEach((element) => {
    // Перевірка, чи є елемент числом
    if (typeof element === "number") {
      // Додавання числового елемента до суми
      sum += element;
    }
  });

  // Повертаємо суму
  return sum;
}

// Приклад використання функції sumNumbers
console.log("Завдання: 12 ==============================");
console.log(
  "Сума чисел у множині:",
  sumNumbers(new Set([1, 2, "a", 3, "b", 4, 5]))
);
// Виведе: Сума чисел у множині: 15
